Revit 2026 API

# GradientGradientColor Property

---

The property labeled "Color" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientColor { get; }
```
```vb
Public Shared ReadOnly Property GradientColor As String
	Get
```
```cpp
public:
static property String^ GradientColor {
	String^ get ();
}
```
```fsharp
static member GradientColor : string with get
```

#### Property Value

String

This property is a "AssetPropertyList" of type "AssetPropertyDoubleArray4d".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace